DOSSIER.org
#+TITLE: Viaje con Inteligencia - Dossier Técnico y Estratégico
#+AUTHOR: M. Castillo
#+EMAIL: mybloggingnotes@gmail.com
#+DATE: 2026-04-27
#+STARTUP: content
#+LANGUAGE: es
#+OPTIONS: author:nil

* TABLE OF CONTENTS :no_export:
:PROPERTIES:
:UNNUMBERED: toc
:END:
- [[#introduccion][Introducción]]
- [[#arquitectura][Arquitectura del Sistema]]
- [[#fuentes-datos][Fuentes de Datos]]
- [[#ia-ml][Inteligencia Artificial y Machine Learning]]
- [[#diferenciacion][Diferenciación]]
- [[#telegram][Canal de Telegram]]
- [[#mastodon][Integración Mastodon]]
- [[#modelo-negocio][Modelo de Negocio]]
- [[#crecimiento][Potencial de Crecimiento]]
- [[#tecnologia][Tecnología]]
- [[#roadmap][Roadmap]]
- [[#anexos][Anexos]]

* INTRODUCCIÓN :no_export:
:PROPERTIES:
:CUSTOM_ID: introduccion
:END:

** Visión del Proyecto

Viaje con Inteligencia es una plataforma de planificación de viajes que utiliza inteligencia artificial y machine learning para ofrecer recomendaciones personalizadas, alertas en tiempo real y análisis que ningún otro servicio proporciona. A diferencia de las aplicaciones de viaje tradicionales que operan con datos estáticos y recomendaciones genéricas, nuestro sistema aprende de las preferencias del usuario, integra fuentes oficiales en tiempo real y proporciona recomendaciones contextuales únicas.

** Problema que Resuelve

El viajero moderno se enfrenta a un ecosistema fragmentado:
- Aplicaciones de地名 con información desactualizada
- Guías de viaje genéricas que ignoran preferencias individuales
- Alertas de seguridad dispersas en múltiples fuentes
- cero personalización contextual

Viaje con Inteligencia unifica estas funciones en un solo ecosistema inteligente.

** Propuesta de Valor

| Aspecto | Tradicional | Nuestra Solución |
|--------|------------|-----------------|
| Datos | Estáticos, desactualizados | Tiempo real, oficiales |
| Recomendaciones | Genéricas | ML personalizado |
| Alertas | Fragmentadas | Unificadas, proactivas |
| Experiencia | Transaccional | Contextual, aprend |

** Métricas Actuales (2026-04-27)

| Métrica | Valor |
|--------|-------|
| Países cubiertos | 95+ |
| Posts blog | 52 |
| Usuarios Telegram | ~50 |
| Suscriptores newsletter | 12+ |
| Rutas temáticas ML | 4 |
| Regiones vinícolas | 8 |

* ARQUITECTURA DEL SISTEMA :no_export:
:PROPERTIES:
:CUSTOM_ID: arquitectura
:END:

** DIAGRAMAS ARQUITECTURA

#+begin_src text
[Usuario] --> [Frontend Next.js]
[Frontend] --> [API Routes]
[API Routes] --> [Supabase]
[API Routes] --> [Telegram Bot]
[API Routes] --> [Mastodon]
[API Routes] --> [Resend]
[ML Engine] --> [Clustering]
[ML Engine] --> [Recommendations]
[INE/MAEC/OMS] --> [API Routes]
#+end_src

** Componentes Principales

| Componente | Tecnología | Función |
|-----------|------------|---------|
| Frontend | Next.js 14 | UI/reactiva |
| Backend | Next.js API Routes | Endpoints serverless |
| Base de datos | Supabase | PostgreSQL + Auth |
| ML Engine | Python/TypeScript | Algoritmos |
| Telegram Bot | Telegram API | Interacciones |
| Email | Resend | Newsletters |
| Hosting | Vercel | Despliegue |

** APIs Principales

#+begin_example
[Frontend] ---> [API Routes] ---> [Supabase]
                    |
                    +--> [Telegram Bot]
                    |
                    +--> [Mastodon]
                    |
                    +--> [Resend]

[INE/MAEC/OMS] ---> [API Routes]
#+end_example

* FUENTES DE DATOS :no_export:
:PROPERTIES:
:CUSTOM_ID: fuentes-datos
:END:

** Fuentes Oficiales Integradas

| Fuente | Datos | Frecuencia | Uso |
|--------|-------|-----------|-----|
| MAEC | Alertas viaje | Diario | Scraper riesgo |
| INE | Turistas, occupancy | Mensual | IST, ML |
| OMS | Alertas sanitarias | Variable | Salud viajeros |
| AEMET | Meteorología | Hora | Clima tiempo real |
| UNWTO | Estadísticas globales | Anual | KPIs turismo |

** Detalle de Fuentes

*** MAEC - Ministerio de Asuntos Exteriores

El sistema scraping del MAEC se ejecuta diariamente a las 06:00 UTC, extrayendo:
- Nivel de riesgo por país
- Recomendaciones específicas
- Enlaces a fichas país PDF
- Últimas alertas de seguridad

*** Flujo Scraping MAEC

#+begin_example
[Init] --> [06:00 UTC Daily]
[06:00 UTC Daily] --> [Fetch MAEC alerts]
[Fetch MAEC alerts] --> [Parse HTML]
[Parse HTML] --> [Store Supabase]
[Store Supabase] --> [Notify Telegram/Email]
[Notify Telegram/Email] --> [Done]
#+end_example

*** INE - Instituto Nacional de Estadística

Datos de turismo de España (FRONTUR/EGATUR):
- Llegadas de turistas internacionales
- Pernoctaciones por origen
- Estancia media
- Ingresos por turismo

** Sistema de Alertas

| Tipo | Canal | Frecuencia |
|------|------|-----------|
| Riesgo país | Telegram Bot | On-demand |
| Resumen diario | Email + Telegram | 00:00 UTC |
| Digest semanal | Email + Telegram + Mastodon | Lunes 08:00 |

* INTELIGENCIA ARTIFICIAL Y MACHINE LEARNING :no_export:
:PROPERTIES:
:CUSTOM_ID: ia-ml
:END:

** Stack de ML Implementado

| Algoritmo | Uso | Datos |
|----------|-----|-------|
| K-Means Clustering | Segmentación destinos | Riesgo, IPC, tourist arrivals |
| Preference Matching | Recomendaciones | user prefs + destination attributes |
| Risk Scoring | Análisis riesgo | MAEC + OMS + historical |
| Time Series | Predicción precios | Historical INE |

** Sistema de Recomendaciones

#+begin_example
Input:  [User Prefs] --> [Budget] --> [Dates]
                         |           |
                         v           v
Feature Engineering --> Model Scoring --> Ranking --> Output (Top 3)

Scoring: (prefMatch × 3) + (value × 2) + (safety × 1.5)
#+end_example

*** Algoritmo de Scoring

@enduml
#+end_src

** Scoring Algorithm

#+begin_example
preferenceMatchScore = Σ(pref_weight × attribute_match)
valueScore = (price_historical / current_price) × 100
safetyScore = (10 - risk_level) × 10
crowdScore = ist_index × season_multiplier

finalScore = (preferenceMatchScore × 0.4) + 
           (valueScore × 0.25) + 
           (safetyScore × 0.20) + 
           (crowdScore × 0.15)
#+end_example

** ML Features por Ruta

| Ruta | Popularity | Safety | Value | Best Season |
|------|------------|--------|-------|-------------|
| Molinos La Mancha | 7.5 | 9.5 | 8.5 | Abr-May, Sept-Oct |
| Faros Costa | 8.5 | 9.0 | 7.0 | May-Jun, Sept-Oct |
| Murcia Interior | 6.0 | 9.5 | 9.0 | Mar-May, Oct-Nov |
| Rutas del Vino | 7.0 | 9.5 | 8.5 | Mar-May, Sept-Nov |

** clustering de Destinos

El sistema utiliza K-Means clustering con 7 segmentos:
1. 🏖️ Playa - destinos costeros
2. 🏛️ Cultural - patrimonio histórico
3. 👨‍👩‍👧‍👦 Familiar - seguro, económico
4. 🏔️ Naturaleza - aventura, naturaleza
5. 💼 Negocio - centros business
6. Salud - wellbeing, spa
7. 🏔️ Montana - ski, montaña

* DIFERENCIACIÓN :no_export:
:PROPERTIES:
:CUSTOM_ID: diferenciacion
:END:

