DOSSIER.tex
% Created 2026-04-27 lun 14:20
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\date{2026-04-27}
\title{Viaje con Inteligencia - Dossier Técnico y Estratégico}
\hypersetup{
 pdfauthor={M. Castillo},
 pdftitle={Viaje con Inteligencia - Dossier Técnico y Estratégico},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.3 (Org mode 9.4.6)}, 
 pdflang={Spanish}}
\begin{document}

\maketitle
\tableofcontents


\section*{TABLE OF CONTENTS\hfill{}\textsc{no\_export}}
\label{sec:org53613ad}
\begin{itemize}
\item \hyperref[sec:org76da974]{Introducción}
\item \hyperref[sec:orgcb094a1]{Arquitectura del Sistema}
\item \hyperref[sec:org4c806f0]{Fuentes de Datos}
\item \hyperref[sec:orgb426034]{Inteligencia Artificial y Machine Learning}
\item \hyperref[sec:orgb572a20]{Diferenciación}
\item \hyperref[sec:org3e74d2b]{Canal de Telegram}
\item \hyperref[sec:org7f38bb1]{Integración Mastodon}
\item \hyperref[sec:org076d7f8]{Modelo de Negocio}
\item \hyperref[sec:org0d514bc]{Potencial de Crecimiento}
\item \hyperref[sec:org28fae3a]{Tecnología}
\item \hyperref[sec:org246f1d0]{Roadmap}
\item \hyperref[sec:org902dbd2]{Anexos}
\end{itemize}

\section{INTRODUCCIÓN\hfill{}\textsc{no\_export}}
\label{sec:org76da974}
\subsection{Visión del Proyecto}
\label{sec:orgdd6be1e}

Viaje con Inteligencia es una plataforma de planificación de viajes que utiliza inteligencia artificial y machine learning para ofrecer recomendaciones personalizadas, alertas en tiempo real y análisis que ningún otro servicio proporciona. A diferencia de las aplicaciones de viaje tradicionales que operan con datos estáticos y recomendaciones genéricas, nuestro sistema aprende de las preferencias del usuario, integra fuentes oficiales en tiempo real y proporciona recomendaciones contextuales únicas.

\subsection{Problema que Resuelve}
\label{sec:orga0928bf}

El viajero moderno se enfrenta a un ecosistema fragmentado:
\begin{itemize}
\item Aplicaciones de地名 con información desactualizada
\item Guías de viaje genéricas que ignoran preferencias individuales
\item Alertas de seguridad dispersas en múltiples fuentes
\item cero personalización contextual
\end{itemize}

Viaje con Inteligencia unifica estas funciones en un solo ecosistema inteligente.

\subsection{Propuesta de Valor}
\label{sec:orgddc39ea}

\begin{center}
\begin{tabular}{lll}
Aspecto & Tradicional & Nuestra Solución\\
\hline
Datos & Estáticos, desactualizados & Tiempo real, oficiales\\
Recomendaciones & Genéricas & ML personalizado\\
Alertas & Fragmentadas & Unificadas, proactivas\\
Experiencia & Transaccional & Contextual, aprend\\
\end{tabular}
\end{center}

\subsection{Métricas Actuales (2026-04-27)}
\label{sec:org5c71dd6}

\begin{center}
\begin{tabular}{lr}
Métrica & Valor\\
\hline
Países cubiertos & 95+\\
Posts blog & 52\\
Usuarios Telegram & \textasciitilde{}50\\
Suscriptores newsletter & 12+\\
Rutas temáticas ML & 4\\
Regiones vinícolas & 8\\
\end{tabular}
\end{center}

\section{ARQUITECTURA DEL SISTEMA\hfill{}\textsc{no\_export}}
\label{sec:orgcb094a1}
\subsection{DIAGRAMAS ARQUITECTURA}
\label{sec:org619ca2d}

\lstset{language=text,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
[Usuario] --> [Frontend Next.js]
[Frontend] --> [API Routes]
[API Routes] --> [Supabase]
[API Routes] --> [Telegram Bot]
[API Routes] --> [Mastodon]
[API Routes] --> [Resend]
[ML Engine] --> [Clustering]
[ML Engine] --> [Recommendations]
[INE/MAEC/OMS] --> [API Routes]
\end{lstlisting}

\subsection{Componentes Principales}
\label{sec:org95b90ff}

\begin{center}
\begin{tabular}{lll}
Componente & Tecnología & Función\\
\hline
Frontend & Next.js 14 & UI/reactiva\\
Backend & Next.js API Routes & Endpoints serverless\\
Base de datos & Supabase & PostgreSQL + Auth\\
ML Engine & Python/TypeScript & Algoritmos\\
Telegram Bot & Telegram API & Interacciones\\
Email & Resend & Newsletters\\
Hosting & Vercel & Despliegue\\
\end{tabular}
\end{center}

\subsection{APIs Principales}
\label{sec:orgf3af991}

\begin{verbatim}
[Frontend] ---> [API Routes] ---> [Supabase]
                    |
                    +--> [Telegram Bot]
                    |
                    +--> [Mastodon]
                    |
                    +--> [Resend]

[INE/MAEC/OMS] ---> [API Routes]
\end{verbatim}

\section{FUENTES DE DATOS\hfill{}\textsc{no\_export}}
\label{sec:org4c806f0}
\subsection{Fuentes Oficiales Integradas}
\label{sec:org34948df}

\begin{center}
\begin{tabular}{llll}
Fuente & Datos & Frecuencia & Uso\\
\hline
MAEC & Alertas viaje & Diario & Scraper riesgo\\
INE & Turistas, occupancy & Mensual & IST, ML\\
OMS & Alertas sanitarias & Variable & Salud viajeros\\
AEMET & Meteorología & Hora & Clima tiempo real\\
UNWTO & Estadísticas globales & Anual & KPIs turismo\\
\end{tabular}
\end{center}

\subsection{Detalle de Fuentes}
\label{sec:org65a2589}

\subsubsection{MAEC - Ministerio de Asuntos Exteriores}
\label{sec:org7c8d67d}

El sistema scraping del MAEC se ejecuta diariamente a las 06:00 UTC, extrayendo:
\begin{itemize}
\item Nivel de riesgo por país
\item Recomendaciones específicas
\item Enlaces a fichas país PDF
\item Últimas alertas de seguridad
\end{itemize}

\subsubsection{Flujo Scraping MAEC}
\label{sec:org9973216}

\begin{verbatim}
[Init] --> [06:00 UTC Daily]
[06:00 UTC Daily] --> [Fetch MAEC alerts]
[Fetch MAEC alerts] --> [Parse HTML]
[Parse HTML] --> [Store Supabase]
[Store Supabase] --> [Notify Telegram/Email]
[Notify Telegram/Email] --> [Done]
\end{verbatim}

\subsubsection{INE - Instituto Nacional de Estadística}
\label{sec:orgc96cf3b}

Datos de turismo de España (FRONTUR/EGATUR):
\begin{itemize}
\item Llegadas de turistas internacionales
\item Pernoctaciones por origen
\item Estancia media
\item Ingresos por turismo
\end{itemize}

\subsection{Sistema de Alertas}
\label{sec:org33cb02c}

\begin{center}
\begin{tabular}{lll}
Tipo & Canal & Frecuencia\\
\hline
Riesgo país & Telegram Bot & On-demand\\
Resumen diario & Email + Telegram & 00:00 UTC\\
Digest semanal & Email + Telegram + Mastodon & Lunes 08:00\\
\end{tabular}
\end{center}

\section{INTELIGENCIA ARTIFICIAL Y MACHINE LEARNING\hfill{}\textsc{no\_export}}
\label{sec:orgb426034}
\subsection{Stack de ML Implementado}
\label{sec:org5473f64}

\begin{center}
\begin{tabular}{lll}
Algoritmo & Uso & Datos\\
\hline
K-Means Clustering & Segmentación destinos & Riesgo, IPC, tourist arrivals\\
Preference Matching & Recomendaciones & user prefs + destination attributes\\
Risk Scoring & Análisis riesgo & MAEC + OMS + historical\\
Time Series & Predicción precios & Historical INE\\
\end{tabular}
\end{center}

\subsection{Sistema de Recomendaciones}
\label{sec:orgd82b968}

\begin{verbatim}
Input:  [User Prefs] --> [Budget] --> [Dates]
                         |           |
                         v           v
Feature Engineering --> Model Scoring --> Ranking --> Output (Top 3)

Scoring: (prefMatch × 3) + (value × 2) + (safety × 1.5)
\end{verbatim}

\subsubsection{Algoritmo de Scoring}
\label{sec:org7e757d1}

@enduml
\#+end\textsubscript{src}

\subsection{Scoring Algorithm}
\label{sec:orgbe5041b}

\begin{verbatim}
preferenceMatchScore = Σ(pref_weight × attribute_match)
valueScore = (price_historical / current_price) × 100
safetyScore = (10 - risk_level) × 10
crowdScore = ist_index × season_multiplier

finalScore = (preferenceMatchScore × 0.4) + 
           (valueScore × 0.25) + 
           (safetyScore × 0.20) + 
           (crowdScore × 0.15)
\end{verbatim}

\subsection{ML Features por Ruta}
\label{sec:orgd35ecb0}

\begin{center}
\begin{tabular}{lrrrl}
Ruta & Popularity & Safety & Value & Best Season\\
\hline
Molinos La Mancha & 7.5 & 9.5 & 8.5 & Abr-May, Sept-Oct\\
Faros Costa & 8.5 & 9.0 & 7.0 & May-Jun, Sept-Oct\\
Murcia Interior & 6.0 & 9.5 & 9.0 & Mar-May, Oct-Nov\\
Rutas del Vino & 7.0 & 9.5 & 8.5 & Mar-May, Sept-Nov\\
\end{tabular}
\end{center}

\subsection{clustering de Destinos}
\label{sec:orgb5e309e}

El sistema utiliza K-Means clustering con 7 segmentos:
\begin{enumerate}
\item 🏖️ Playa - destinos costeros
\item 🏛️ Cultural - patrimonio histórico
\item 👨‍👩‍👧‍👦 Familiar - seguro, económico
\item 🏔️ Naturaleza - aventura, naturaleza
\item 💼 Negocio - centros business
\item Salud - wellbeing, spa
\item 🏔️ Montana - ski, montaña
\end{enumerate}

\section{DIFERENCIACIÓN\hfill{}\textsc{no\_export}}
\label{sec:orgb572a20}
