DOSSIER.org
** Comparativa con Competidores

| Aspecto | TripAdvisor | Lonely Planet | Booking | Viaje con IA |
|---------|------------|--------------|---------|--------------|
| Datos oficiales | ❌ Parcial | ✅ Estático | ❌ | ✅ Tiempo real |
| ML personalized | ❌ | ❌ | ❌ | ✅ |
| Alertas MAEC | ❌ | ❌ | ❌ | ✅ |
| Rutas temáticas ML | ❌ | ❌ | ❌ | ✅ |
| Telegram Bot | ❌ | ❌ | ❌ | ✅ |
| Mastodon | ❌ | ❌ | ❌ | ✅ |

** Ventajas Competitivas

*** 1. Datos Oficiales, Tiempo Real

比其他平台更新的数据，来自官方来源：
- MAEC alerts → 每日更新
- INE statistics → 每月更新
- OMS health → 实时更新

*** 2. Machine Learning Personalizado

我们的推荐引擎不是"如果-那么"规则，而是从以下学习：
- 类似用户的行为模式
- 您明确的偏好
- 隐式反馈（点击、停留时间）

*** 3. Integración Completa

单一平台提供：
- 搜索 → 推荐 → 预订全部
- 警报 → 风险分析
- 行程 → 优化

*** 4. Canales Múltiples

| Canal | Función |
|-------|--------|
| Web | Búsqueda, recomendaciones |
| Telegram Bot | Alertas interactivas |
| Telegram Channel | Newsletter automático |
| Mastodon | Presencia social |
| Email | Resumen semanal |

** Propuesta Única de Venta (PUV)

> "La única plataforma de viajes en español que combina inteligencia artificial + machine learning con datos oficiales en tiempo real para ofrecer recomendaciones verdaderamente personalizadas."

* CANAL DE TELEGRAM :no_export:
:PROPERTIES:
:CUSTOM_ID: telegram
:END:

** Arquitectura Telegram

#+begin_example
[Canal: @ViajeConInteligencia] <-- [Bot interactivo]
[Bot: @ViajeConInteligenciaBot] <-- [API Routes]

Backend --> [sendTelegramMessage] --> [Canal]
         --> [cron/digest] --> [Canal]
         --> [newsletter] --> [Canal]

Funciones: Alertas riesgo + Resumen semanal + Posts blog
#+end_example

** Comandos Disponibles
[Alertas riesgo] ..> [Bot: @ViajeConInteligenciaBot]
[Resumen semanal] ..> [Canal: @ViajeConInteligencia]
[Posts blog] ..> [Canal: @ViajeConInteligencia]

note right of [Canal: @ViajeConInteligencia]
  Recibe posts automáticamente
  cada semana + alertas
end note

@enduml
#+end_src

** Comandos Disponibles

| Comando | Función |
|---------|---------|
| /start | Bienvenida + información |
| /alertasviaje | Resumen de alertas de riesgo |
| /alertasviaje full | Detalle completo |
| /help | Ayuda |
| /suscribirse | Alta en newsletter |

** Integración con ML

El Bot utiliza el sistema de recomendaciones ML para:
- Responder consultas de países específicos
- Proporcionar recomendaciones personalizadas
- Analizar riesgo contextual

** Métricas de Uso

| Métrica | Valor |
|--------|-------|
| Usuarios activos | ~50 |
| Mensajes/día | Variable |
| Suscriptores canal | Incrementando |

* INTEGRACIÓN MASTODON :no_export:
:PROPERTIES:
:CUSTOM_ID: mastodon
:END:

** Presencia en Mastodon

| Aspecto | Valor |
|--------|-------|
| Cuenta | @viajeinteligencia@mastodon.social |
| Seguidores | Growing |
| Publicaciones | Automáticas (cron) + Manuales |

** Sistema de Publicación Automática

| Trigger | Contenido |
|---------|-----------|
| Nuevo post blog | Resumen + hashtags |
| Digest semanal | Top posts + alertas |
| Alerta MAEC importante | Enlace a análisis |

** API de Publicación

#+begin_example
Triggers:Nuevo blog post | cron/digest | manual
API: POST /api/v1/statuses
Token: MASTODON_ACCESS_TOKEN
Visibility: public
#+end_example

* MODELO DE NEGOCIO :no_export:
:PROPERTIES:
:CUSTOM_ID: modelo-negocio
:END:

** Estructura de Ingresos

| Tier | Precio | Funcionalidades |
|------|--------|--------------|
| Free | 0€ | Búsqueda país, alertas básicas, 3 posts blog/mes |
| Premium | 4.99€/mes | ML recomendaciones completas, newsletter, PDF checklist |
| yearly | 19.99€/año | Todo premium + priority alerts |

** Funcionalidades por Tier

| Feature | Free | Premium |
|--------|------|---------|
| Países en mapa | ✅ | ✅ |
| Alertas MAEC | Básica | Completa |
| ML recomendaciones | 3/día | Ilimitado |
| Newsletter | - | ✅ |
| PDF checklist | - | ✅ |
| Priority alerts | - | ✅ |
| Historial favoritos | - | ✅ |

** Suscripciones (Stripe)

| Métrica | Actual | Target Q2 2026 |
|--------|--------|----------------|
| Suscripciones | 0 | 100 |
| MRR | 0€ | ~300€ |
| Churn | - | <5% |

* POTENCIAL DE CRECIMIENTO :no_export:
:PROPERTIES:
:CUSTOM_ID: crecimiento
:END:

** Análisis de Mercado

| Segmento | TAM | Share Viabilidad |
|----------|-----|-----------------|
| Viajes España | 100M€/año | 0.1% → 1% = 1M€ |
| Viajes outbound España | 30M personas/año | 0.1% → 0.5% = 150K |
| Enoturismo | 5M€/año | 1% → 5% = 250K€ |

** Factores de Crecimiento

*** 1. SEO y Contenido
- 52+ posts blog indexados
- Keywords long-tail: "es seguro viajar a [país]"
- Datos estructurados JSON-LD

*** 2. Red de Distribución
- Telegram: ~50 usuarios base
- Mastodon: presencia social
- Email: 12+ suscriptores

*** 3. Viralidad
- Recomendaciones ML comparten
- Alertas de riesgo comparten

** Proyección 12 Meses

| Métrica | Q2 2026 | Q3 2026 | Q4 2026 |
|--------|---------|---------|---------|
| Visitantes/mes | 1,000 | 5,000 | 10,000 |
| Usuarios registrados | 100 | 500 | 1,000 |
| Suscripciones premium | 25 | 100 | 250 |
| Ingresos MRR | 100€ | 400€ | 1,000€ |

** Expansión Geográfica

| Fase | Mercados | Timeline |
|------|---------|----------|
| 1 | España (base) | Done |
| 2 | Latinoamérica hispanohablante | Q3 2026 |
| 3 | Portugal | Q4 2026 |
| 4 | English market | 2027 |

* TECNOLOGÍA :no_export:
:PROPERTIES:
:CUSTOM_ID: tecnologia
:END:

** Stack Técnico

| Capa | Tecnología |
|------|------------|
| Frontend | Next.js 14, React, Tailwind |
| Backend | Next.js API Routes |
| Base de datos | Supabase (PostgreSQL) |
| Auth | Supabase Auth |
| ML | TypeScript + Python |
| Email | Resend |
| Pagos | Stripe |
| Hosting | Vercel |
| CDN | Vercel Edge |

** Dependencias Principales

#+begin_example
dependencies:
  next: ^14.0.0
  react: ^18.0.0
  @supabase/supabase-js: ^2.0.0
  @stripe/stripe-js: ^2.0.0
  react-leaflet: ^4.0.0
  dexie: ^4.0.0 (IndexedDB)
  jspdf: ^2.0.0
  resend: ^3.0.0
#+end_example

** Infraestructura Vercel

| Recurso | Configuración |
|--------|--------------|
| Functions | Serverless |
| Cron Jobs | 4 configured |
| Edge Functions | En desarrollo |
|Preview | PR automáticas |

** Seguridad

- Variables de entorno en Vercel
- Auth con Supabase Auth
- Rate limiting básico
- CSRF protection
- Sanitización de inputs

* ROADMAP :no_export:
:PROPERTIES:
:CUSTOM_ID: roadmap
:END:

** 2026 Roadmap

| Prioridad | Feature | Estado | Q |
|----------|---------|--------|---|
| 🔴 Alta | Programa afiliados | Pending | Q2 |
| 🟠 Media | AviationStack API | Pending | Q2 |
| 🟠 Media | Predicción precios ML | Pending | Q3 |
| 🟡 Baja | App móvil PWA | In progress | Q2 |
| 🟡 Baja | Anomaly detection | Pending | Q4 |

** Features Futuros

| Feature | Descripción | Impacto |
|--------|-------------|---------|
| Predicción precios | ML predicciones vuelos | Alto |
| Recomendaciones predictivas | Sugerir antes de buscar | Alto |
| Integración calendario | Alarmas contextuales | Medio |
| Marketplace | Affiliate hoteless | Alto |

* ANEXOS :no_export:
:PROPERTIES:
:CUSTOM_ID: anexos
:END:

