DOSSIER.tex
\subsection{Comparativa con Competidores}
\label{sec:orgceb8615}

\begin{center}
\begin{tabular}{lllll}
Aspecto & TripAdvisor & Lonely Planet & Booking & Viaje con IA\\
\hline
Datos oficiales & ❌ Parcial & ✅ Estático & ❌ & ✅ Tiempo real\\
ML personalized & ❌ & ❌ & ❌ & ✅\\
Alertas MAEC & ❌ & ❌ & ❌ & ✅\\
Rutas temáticas ML & ❌ & ❌ & ❌ & ✅\\
Telegram Bot & ❌ & ❌ & ❌ & ✅\\
Mastodon & ❌ & ❌ & ❌ & ✅\\
\end{tabular}
\end{center}

\subsection{Ventajas Competitivas}
\label{sec:orgd0e07fa}

\subsubsection{1. Datos Oficiales, Tiempo Real}
\label{sec:org416fa64}

比其他平台更新的数据，来自官方来源：
\begin{itemize}
\item MAEC alerts → 每日更新
\item INE statistics → 每月更新
\item OMS health → 实时更新
\end{itemize}

\subsubsection{2. Machine Learning Personalizado}
\label{sec:orgc3e0df2}

我们的推荐引擎不是"如果-那么"规则，而是从以下学习：
\begin{itemize}
\item 类似用户的行为模式
\item 您明确的偏好
\item 隐式反馈（点击、停留时间）
\end{itemize}

\subsubsection{3. Integración Completa}
\label{sec:org50b9888}

单一平台提供：
\begin{itemize}
\item 搜索 → 推荐 → 预订全部
\item 警报 → 风险分析
\item 行程 → 优化
\end{itemize}

\subsubsection{4. Canales Múltiples}
\label{sec:org96a7a2a}

\begin{center}
\begin{tabular}{ll}
Canal & Función\\
\hline
Web & Búsqueda, recomendaciones\\
Telegram Bot & Alertas interactivas\\
Telegram Channel & Newsletter automático\\
Mastodon & Presencia social\\
Email & Resumen semanal\\
\end{tabular}
\end{center}

\subsection{Propuesta Única de Venta (PUV)}
\label{sec:org44f5b8a}

> "La única plataforma de viajes en español que combina inteligencia artificial + machine learning con datos oficiales en tiempo real para ofrecer recomendaciones verdaderamente personalizadas."

\section{CANAL DE TELEGRAM\hfill{}\textsc{no\_export}}
\label{sec:org3e74d2b}
\subsection{Arquitectura Telegram}
\label{sec:org96f6e3e}

\begin{verbatim}
[Canal: @ViajeConInteligencia] <-- [Bot interactivo]
[Bot: @ViajeConInteligenciaBot] <-- [API Routes]

Backend --> [sendTelegramMessage] --> [Canal]
         --> [cron/digest] --> [Canal]
         --> [newsletter] --> [Canal]

Funciones: Alertas riesgo + Resumen semanal + Posts blog
\end{verbatim}

\subsection{Comandos Disponibles}
\label{sec:orge6b172f}
[Alertas riesgo] ..> [Bot: @ViajeConInteligenciaBot]
[Resumen semanal] ..> [Canal: @ViajeConInteligencia]
[Posts blog] ..> [Canal: @ViajeConInteligencia]

note right of [Canal: @ViajeConInteligencia]
  Recibe posts automáticamente
  cada semana + alertas
end note

@enduml
\#+end\textsubscript{src}

\subsection{Comandos Disponibles}
\label{sec:org2e1522c}

\begin{center}
\begin{tabular}{ll}
Comando & Función\\
\hline
/start & Bienvenida + información\\
/alertasviaje & Resumen de alertas de riesgo\\
/alertasviaje full & Detalle completo\\
/help & Ayuda\\
/suscribirse & Alta en newsletter\\
\end{tabular}
\end{center}

\subsection{Integración con ML}
\label{sec:org63df571}

El Bot utiliza el sistema de recomendaciones ML para:
\begin{itemize}
\item Responder consultas de países específicos
\item Proporcionar recomendaciones personalizadas
\item Analizar riesgo contextual
\end{itemize}

\subsection{Métricas de Uso}
\label{sec:orgebd2cd5}

\begin{center}
\begin{tabular}{ll}
Métrica & Valor\\
\hline
Usuarios activos & \textasciitilde{}50\\
Mensajes/día & Variable\\
Suscriptores canal & Incrementando\\
\end{tabular}
\end{center}

\section{INTEGRACIÓN MASTODON\hfill{}\textsc{no\_export}}
\label{sec:org7f38bb1}
\subsection{Presencia en Mastodon}
\label{sec:orgc340f90}

\begin{center}
\begin{tabular}{ll}
Aspecto & Valor\\
\hline
Cuenta & @viajeinteligencia@mastodon.social\\
Seguidores & Growing\\
Publicaciones & Automáticas (cron) + Manuales\\
\end{tabular}
\end{center}

\subsection{Sistema de Publicación Automática}
\label{sec:orgf765a69}

\begin{center}
\begin{tabular}{ll}
Trigger & Contenido\\
\hline
Nuevo post blog & Resumen + hashtags\\
Digest semanal & Top posts + alertas\\
Alerta MAEC importante & Enlace a análisis\\
\end{tabular}
\end{center}

\subsection{API de Publicación}
\label{sec:org50d761a}

\begin{verbatim}
Triggers:Nuevo blog post | cron/digest | manual
API: POST /api/v1/statuses
Token: MASTODON_ACCESS_TOKEN
Visibility: public
\end{verbatim}

\section{MODELO DE NEGOCIO\hfill{}\textsc{no\_export}}
\label{sec:org076d7f8}
\subsection{Estructura de Ingresos}
\label{sec:org50cb266}

\begin{center}
\begin{tabular}{lll}
Tier & Precio & Funcionalidades\\
\hline
Free & 0€ & Búsqueda país, alertas básicas, 3 posts blog/mes\\
Premium & 4.99€/mes & ML recomendaciones completas, newsletter, PDF checklist\\
yearly & 19.99€/año & Todo premium + priority alerts\\
\end{tabular}
\end{center}

\subsection{Funcionalidades por Tier}
\label{sec:org260d364}

\begin{center}
\begin{tabular}{lll}
Feature & Free & Premium\\
\hline
Países en mapa & ✅ & ✅\\
Alertas MAEC & Básica & Completa\\
ML recomendaciones & 3/día & Ilimitado\\
Newsletter & - & ✅\\
PDF checklist & - & ✅\\
Priority alerts & - & ✅\\
Historial favoritos & - & ✅\\
\end{tabular}
\end{center}

\subsection{Suscripciones (Stripe)}
\label{sec:orgd21b605}

\begin{center}
\begin{tabular}{lll}
Métrica & Actual & Target Q2 2026\\
\hline
Suscripciones & 0 & 100\\
MRR & 0€ & \textasciitilde{}300€\\
Churn & - & <5\%\\
\end{tabular}
\end{center}

\section{POTENCIAL DE CRECIMIENTO\hfill{}\textsc{no\_export}}
\label{sec:org0d514bc}
\subsection{Análisis de Mercado}
\label{sec:org2378758}

\begin{center}
\begin{tabular}{lll}
Segmento & TAM & Share Viabilidad\\
\hline
Viajes España & 100M€/año & 0.1\% → 1\% = 1M€\\
Viajes outbound España & 30M personas/año & 0.1\% → 0.5\% = 150K\\
Enoturismo & 5M€/año & 1\% → 5\% = 250K€\\
\end{tabular}
\end{center}

\subsection{Factores de Crecimiento}
\label{sec:org97bca0a}

\subsubsection{1. SEO y Contenido}
\label{sec:orgd6c35bd}
\begin{itemize}
\item 52+ posts blog indexados
\item Keywords long-tail: "es seguro viajar a [país]"
\item Datos estructurados JSON-LD
\end{itemize}

\subsubsection{2. Red de Distribución}
\label{sec:orgeaeb569}
\begin{itemize}
\item Telegram: \textasciitilde{}50 usuarios base
\item Mastodon: presencia social
\item Email: 12+ suscriptores
\end{itemize}

\subsubsection{3. Viralidad}
\label{sec:org8350b1a}
\begin{itemize}
\item Recomendaciones ML comparten
\item Alertas de riesgo comparten
\end{itemize}

\subsection{Proyección 12 Meses}
\label{sec:org06743dd}

\begin{center}
\begin{tabular}{llll}
Métrica & Q2 2026 & Q3 2026 & Q4 2026\\
\hline
Visitantes/mes & 1,000 & 5,000 & 10,000\\
Usuarios registrados & 100 & 500 & 1,000\\
Suscripciones premium & 25 & 100 & 250\\
Ingresos MRR & 100€ & 400€ & 1,000€\\
\end{tabular}
\end{center}

\subsection{Expansión Geográfica}
\label{sec:org9aaa7a6}

\begin{center}
\begin{tabular}{rll}
Fase & Mercados & Timeline\\
\hline
1 & España (base) & Done\\
2 & Latinoamérica hispanohablante & Q3 2026\\
3 & Portugal & Q4 2026\\
4 & English market & 2027\\
\end{tabular}
\end{center}

\section{TECNOLOGÍA\hfill{}\textsc{no\_export}}
\label{sec:org28fae3a}
\subsection{Stack Técnico}
\label{sec:org15b99d1}

\begin{center}
\begin{tabular}{ll}
Capa & Tecnología\\
\hline
Frontend & Next.js 14, React, Tailwind\\
Backend & Next.js API Routes\\
Base de datos & Supabase (PostgreSQL)\\
Auth & Supabase Auth\\
ML & TypeScript + Python\\
Email & Resend\\
Pagos & Stripe\\
Hosting & Vercel\\
CDN & Vercel Edge\\
\end{tabular}
\end{center}

\subsection{Dependencias Principales}
\label{sec:org242b033}

\begin{verbatim}
dependencies:
  next: ^14.0.0
  react: ^18.0.0
  @supabase/supabase-js: ^2.0.0
  @stripe/stripe-js: ^2.0.0
  react-leaflet: ^4.0.0
  dexie: ^4.0.0 (IndexedDB)
  jspdf: ^2.0.0
  resend: ^3.0.0
\end{verbatim}

\subsection{Infraestructura Vercel}
\label{sec:orga0153a5}

\begin{center}
\begin{tabular}{ll}
Recurso & Configuración\\
\hline
Functions & Serverless\\
Cron Jobs & 4 configured\\
Edge Functions & En desarrollo\\
Preview & PR automáticas\\
\end{tabular}
\end{center}

\subsection{Seguridad}
\label{sec:org4e291c5}

\begin{itemize}
\item Variables de entorno en Vercel
\item Auth con Supabase Auth
\item Rate limiting básico
\item CSRF protection
\item Sanitización de inputs
\end{itemize}

\section{ROADMAP\hfill{}\textsc{no\_export}}
\label{sec:org246f1d0}
\subsection{2026 Roadmap}
\label{sec:orgb4ec0a3}

\begin{center}
\begin{tabular}{llll}
Prioridad & Feature & Estado & Q\\
\hline
🔴 Alta & Programa afiliados & Pending & Q2\\
🟠 Media & AviationStack API & Pending & Q2\\
🟠 Media & Predicción precios ML & Pending & Q3\\
🟡 Baja & App móvil PWA & In progress & Q2\\
🟡 Baja & Anomaly detection & Pending & Q4\\
\end{tabular}
\end{center}

\subsection{Features Futuros}
\label{sec:org6fd5b87}

\begin{center}
\begin{tabular}{lll}
Feature & Descripción & Impacto\\
\hline
Predicción precios & ML predicciones vuelos & Alto\\
Recomendaciones predictivas & Sugerir antes de buscar & Alto\\
Integración calendario & Alarmas contextuales & Medio\\
Marketplace & Affiliate hoteless & Alto\\
\end{tabular}
\end{center}

\section{ANEXOS\hfill{}\textsc{no\_export}}
\label{sec:org902dbd2}
