DOSSIER.tex
\subsection{URLs del Proyecto}
\label{sec:org22a458c}

\begin{center}
\begin{tabular}{ll}
Recurso & URL\\
\hline
Web & \url{https://viajeinteligencia.com}\\
Blog & \url{https://viajeinteligencia.com/blog}\\
Vercel & \url{https://viaje-con-inteligencia.vercel.app}\\
KPIs Paz & \url{https://viaje-con-inteligencia.vercel.app/kpi}\\
KPIs Turismo & \url{https://viaje-con-inteligencia.vercel.app/turismo}\\
Bot Telegram & \url{https://t.me/ViajeConInteligenciaBot}\\
Canal Telegram & @ViajeConInteligencia\\
Mastodon & @viajeinteligencia@mastodon.social\\
Repo GitHub & \url{https://github.com/mcasrom/viaje-con-inteligencia}\\
\end{tabular}
\end{center}

\subsection{Variables de Entorno}
\label{sec:org545d2c7}

\begin{center}
\begin{tabular}{ll}
Variable & Descripción\\
\hline
SUPABASE\textsubscript{URL} & URL proyecto Supabase\\
SUPABASE\textsubscript{ANON}\textsubscript{KEY} & Key pública Supabase\\
TELEGRAM\textsubscript{BOT}\textsubscript{TOKEN} & Token Bot Telegram\\
TELEGRAM\textsubscript{CHANNEL}\textsubscript{ID} & ID Canal Telegram\\
MASTODON\textsubscript{ACCESS}\textsubscript{TOKEN} & Token Mastodon\\
CRON\textsubscript{SECRET} & Secret para cron jobs\\
RESEND\textsubscript{API}\textsubscript{KEY} & Key API Resend\\
GROQ\textsubscript{API}\textsubscript{KEY} & Key API Groq (IA)\\
STRIPE\textsubscript{SECRET}\textsubscript{KEY} & Key secret Stripe\\
\end{tabular}
\end{center}

\subsection{Cron Jobs Configurados}
\label{sec:orgffcf73c}

\begin{center}
\begin{tabular}{lll}
Job & Schedule & Función\\
\hline
scrape-maec & 0 6 * * * & Scraping MAEC\\
check-alerts & 0 8 * * * & Verificar alertas\\
weekly-digest & 0 8 * * 1 & Digest semanal\\
daily-digest & 0 0 * * * & Resumen diario\\
\end{tabular}
\end{center}

\subsection{Changelog Reciente}
\label{sec:orgb63290f}

\begin{center}
\begin{tabular}{rl}
Fecha & Cambio\\
\hline
2026-04-27 & Blog post IA/ML Telegram + posts automáticos a Canal\\
2026-04-27 & Rutas del Vino (8 regiones) + ML optimization\\
2026-04-26 & INE Tourism ML clustering\\
2026-04-25 & Planificador Simple + preferencias ML\\
2026-04-24 & Reclamaciones PDF\\
2026-04-23 & PDF Premium completo\\
\end{tabular}
\end{center}

\subsection{Licencia y Contribución}
\label{sec:org80be6ab}

MIT License - contribuciones bienvenidas via GitHub.

\subsection{Contacto}
\label{sec:org82e12bc}

\begin{itemize}
\item Email: mybloggingnotes@gmail.com
\item Autor: M. Castillo
\item Fecha creación: 2024
\item Última actualización: 2026-04-27
\end{itemize}

\section{CONCLUSIÓN\hfill{}\textsc{no\_export}}
\label{sec:org277eef6}

Viaje con Inteligencia representa un cambio de paradigma en la planificación de viajes: de información estática y genérica a inteligencia contextual y personalizada. Con datos oficiales en tiempo real, machine learning avanzada y múltiples canales de distribución, la plataforma está posicionada para capturar el creciente mercado de viajeros españoles que buscan recomendaciones inteligentes.

El potencial de crecimiento es significativo, con múltiples vectores de expansión:
\begin{enumerate}
\item Más usuarios → más datos → mejores recomendaciones (efecto red)
\item Suscripciones premium → ingresos recurrentes
\item Programa afiliados → monetización adicional
\item Expansión geográfica → nuevos mercados
\end{enumerate}

La diferenciación clara vs. competidores tradicionales y el enfoque en IA/ML proporcionan una barrera competitiva sostenible.

---

\textbf{Documento generado: 2026-04-27}
\textbf{Versión: 1.0}
\textbf{Palabras: \textasciitilde{}2,800}
\end{document}